===========================
Simple Double-quoted String
===========================

"lorem ipsum"

---

(program
    (string
        (stx_dquo)))

==============================
Multiline Double-quoted String
==============================

"
		"Lorem ipsum"
		-------------

	dolor sit amet, consec-
	tetur adipiscing elit
"

---

(program
    (string
        (linefeed)
        (strblock
            (strblock
                (stx_line)
                (linefeed)
                (stx_line)
                (linefeed))
            (stx_line)
            (linefeed)
            (stx_line)
            (linefeed))))

==============
Line splitting
==============

"lorem`{
} ipsum"

---

(program
    (string
        (stx_dquo)
        (stx_dquo)))

=======================
Pseudo-multiline String
=======================

"
	actually`{
	} one`{
	} liner
"

---

(program
    (string
        (linefeed)
        (strblock
            (stx_line)
            (stx_line)
            (stx_line)
            (linefeed))))

=============
Interpolation
=============

"lorem `{f x} ipsum"

---

(program
    (string
        (stx_dquo)
        (interpolA
            (applyi
                (id)
                (id)))
        (stx_dquo)))

===============
Interpolception
===============

"lorem `{f "`{g x}"} ipsum"

---

(program
    (string
        (stx_dquo)
        (interpolA
            (applyi
                (id)
                (string
                    (interpolA
                    (applyi
                        (id)
                        (id))))))
        (stx_dquo)))

===================
Block interpolation
===================

"lorem`{
	f
		x
} ipsum"

---

(program
    (string
        (stx_dquo)
        (interpolA
            (program
            (apply2
                (id)
                (id))))
        (stx_dquo)))

=====================
Block interpolception
=====================

"`{"`{
	f
		x
}"}"

---

(program
    (string
        (interpolA
            (string
                (interpolA
                    (program
                        (apply2
                            (id)
                            (id))))))))

=======================
Multiline interpolation
=======================

"
	lorem`{
		f g
			x
		y
	} ipsum
"

---

(program
    (string
        (linefeed)
        (strblock
            (stx_line)
            (interpolA
                (program
                    (apply3
                        (apply2
                            (id)
                            (apply2
                                (id)
                                (id)))
                        (id))))
            (stx_line)
            (linefeed))))

================
No interpolation
================

"lorem ipsum `dolor` sit amet"

---

(program
    (string
        (stx_dquo)
        (stx_dquo)
        (stx_dquo)
        (stx_dquo)
        (stx_dquo)))
